In [1]:
#Dependencies
import pandas as pd
import numpy as np

In [2]:
#Import CSV File
nr_2015_sta_path = "Input_Data/Nice_Ride_2015_station_locations.csv"
nr_2015_trip_path = "Input_Data/Nice_ride_trip_history_2015_season.csv"

In [3]:
#Read data to df
station_15 = pd.read_csv(nr_2015_sta_path, dtype={"Terminal":int, "Station":str, "Latitude":float, "Longitude":float, "NbDocks":int, "Notes":str})
station_15.head()

,Terminal,Station,Latitude,Longitude,NbDocks,Notes
0,30000,100 Main Street SE,44.984892,-93.256551,27,NaN
1,30001,25th Street & 33rd Ave S,44.957341,-93.223374,15,NaN
2,30002,Riverside Ave & 23rd Ave S,44.967115,-93.240149,15,NaN
3,30003,Plymouth Ave N & N Oliver Ave,44.991412,-93.306269,15,NaN
4,30004,11th Street & Hennepin,44.975340,-93.278690,23,NaN

In [4]:
len(station_15)

190

In [5]:
trip_15 = pd.read_csv(nr_2015_trip_path, dtype={"Start date":str, "Start station":str, "Start station number":str, "End date":str, "End station":str, "End station number":str, "Total duration (Seconds)":int, "Account type":str})
trip_15.head()

,Start date,Start station,Start station number,End date,End station,End station number,Total duration (Seconds),Account type
0,11/1/2015 21:55,West 15th Street & Willow,30093,11/1/2015 22:12,Nicollet Island,30170,983,Member
1,11/1/2015 21:55,West 15th Street & Willow,30093,11/1/2015 22:12,Nicollet Island,30170,980,Member
2,11/1/2015 21:55,4th Street & 13th Ave SE,30009,11/1/2015 22:05,Logan Park,30104,565,Casual
3,11/1/2015 21:54,Lyndale Ave S & 22nd Street,30017,11/1/2015 21:55,Lyndale Ave S & 22nd Street,30017,65,Member
4,11/1/2015 21:54,YWCA Downtown,30006,11/1/2015 22:44,YWCA Downtown,30006,3037,Casual

In [6]:
len(trip_15)

483229